Documents/ПоступлениеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ОбщиеМодулиНаКлиенте.ИзменениеСуммыПокупки(ТекущаяСтрока);
КонецПроцедуры


&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ОбщиеМодулиНаКлиенте.ИзменениеСуммыПокупки(ТекущаяСтрока);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(ВыбраннаяНоменклатура)
	Возврат ВыбраннаяНоменклатура.ЦенаПокупки;
КонецФункции

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)  
	
		СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			СтрокаТЧ.ЦенаПокупки = ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура);
			Если ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
				СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.ЦенаПокупки;
			Иначе
				СтрокаТЧ.Количество = 1;
				СтрокаТЧ.Сумма = СтрокаТЧ.ЦенаПокупки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
